HMEAYC/NSTC/NSTC/firmware/sdkconfig.defaults
# ESP32-C3 target
CONFIG_IDF_TARGET="esp32c3"

# Flash size (ESP32-C3 SuperMini has 4MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Custom OTA partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# Enable OTA support
CONFIG_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DOWN_MODE=y
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=n

# Enable app update via OTA
CONFIG_ESP_TLS_ENABLED=n
CONFIG_HTTPD_WS_SUPPORT=n

# WiFi credentials
CONFIG_HMEAYC_WIFI_SSID="chen"
CONFIG_HMEAYC_WIFI_PASSWORD="12345678"

# Firmware version
CONFIG_HMEAYC_FIRMWARE_VERSION="1.0.0"

# Server endpoints (update IP to match your backend)
CONFIG_HMEAYC_WS_URI="ws://192.168.1.105:8080/ws/default"
CONFIG_HMEAYC_API_BASE_URL="http://192.168.1.105:8080/api"
CONFIG_HMEAYC_OTA_BASE_URL="http://192.168.1.105:8080/api/firmware"
